load-tests/stress-500/scenario1-login-500.yml
# 시나리오 1: 500명 동시 로그인 부하테스트
# bcrypt 해싱이 CPU 집약적이므로 동시 로그인 요청 부하 확인
# Rate Limit (10/15min) 때문에 대부분 429 예상 → Rate Limit 내구성 확인
config:
  target: "http://localhost:8080"
  phases:
    - duration: 10
      arrivalRate: 10
      name: "Warm up (10 req/s, ~100 users)"
    - duration: 20
      arrivalRate: 25
      name: "Ramp up (25 req/s, ~500 users)"
    - duration: 10
      arrivalRate: 50
      name: "Peak load (50 req/s)"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Login flood - 500 concurrent"
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "test@test.com"
            password: "test1234"